In [1]:
import pandas as pd

In [4]:
lst = ['Geeks', 'for', 'Geeks', 'is']
df = pd.DataFrame(lst)

In [5]:
df

       0
0  Geeks
1    for
2  Geeks
3     is

In [6]:
type(df)

pandas.core.frame.DataFrame

In [13]:
data = {'Name': [1,2,3], 'Age': [20,30,40]}
df = pd.DataFrame(data)

In [14]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [15]:
df['Age']

0    20
1    30
2    40
Name: Age, dtype: int64

In [16]:
df.isnull()

    Name    Age
0  False  False
1  False  False
2  False  False

In [17]:
df

   Name  Age
0     1   20
1     2   30
2     3   40

In [22]:
for i, j in df.iteritems():
    print(i,j)

Name 0    1
1    2
2    3
Name: Name, dtype: int64
Age 0    20
1    30
2    40
Name: Age, dtype: int64

In [20]:
for key, value in df.items():
    print(key,value)

Name 0    1
1    2
2    3
Name: Name, dtype: int64
Age 0    20
1    30
2    40
Name: Age, dtype: int64

In [23]:
df

   Name  Age
0     1   20
1     2   30
2     3   40

In [31]:
for i in df.columns:
    print(df[i][2])

3
40